In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
# index Levels

In [8]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [6]:
inside

[1, 2, 3, 1, 2, 3]

In [7]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [11]:
from numpy.random import randn
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [12]:
df

             A         B
G1 1 -0.869786  0.418418
   2  0.758050 -3.159357
   3 -0.104159  0.043994
G2 1 -1.234102  0.111991
   2 -0.661742 -1.630574
   3 -0.664016  0.361323

In [13]:
# call data

In [14]:
df.loc['G1']

          A         B
1 -0.869786  0.418418
2  0.758050 -3.159357
3 -0.104159  0.043994

In [15]:
df.loc['G1'].loc[1]

A   -0.869786
B    0.418418
Name: 1, dtype: float64

In [16]:
df.loc['G1']['A']

1   -0.869786
2    0.758050
3   -0.104159
Name: A, dtype: float64

In [17]:
df.loc['G1']['A'].loc[1]

-0.8697856912143462

In [19]:
df.index.names = ['Groups','Num']

In [20]:
df

                   A         B
Groups Num
G1     1   -0.869786  0.418418
       2    0.758050 -3.159357
       3   -0.104159  0.043994
G2     1   -1.234102  0.111991
       2   -0.661742 -1.630574
       3   -0.664016  0.361323

In [23]:
df.loc['G2'].loc[2]['B']

-1.630573542908782

In [24]:
df.loc['G1']

            A         B
Num
1   -0.869786  0.418418
2    0.758050 -3.159357
3   -0.104159  0.043994

In [25]:
df.xs('G1')

            A         B
Num
1   -0.869786  0.418418
2    0.758050 -3.159357
3   -0.104159  0.043994

In [26]:
df.xs(1,level ='Num')

               A         B
Groups
G1     -0.869786  0.418418
G2     -1.234102  0.111991

In [27]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [28]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [30]:
df = pd.DataFrame(d)

In [31]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
# drop any column containing nan
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [35]:
# drop any row containing nan
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [36]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [38]:
# keep any row with 2 or more not nan or 
# keep rows which have 1 or 0 nan
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [40]:
df.dropna(thresh = 3)
# keep those rows which have no nan

     A    B  C
0  1.0  5.0  1

In [41]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [43]:
df[]'A'

SyntaxError: invalid syntax (<ipython-input-43-53fa85f8618b>, line 1)

In [44]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [46]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64